In [1]:
import pandas as pd
import numpy as np

In [2]:
map = {
    "name": ["friendA", "friendB", "friendC", "friendD"],
    "marks": [100, 99, 33, 10],
    "city": ["hyderabad", "pune", "vijaywada", "un"]
}

In [3]:
df = pd.DataFrame(map)

In [5]:
df

      name  marks       city
0  friendA    100  hyderabad
1  friendB     99       pune
2  friendC     33  vijaywada
3  friendD     10         un

In [8]:
df.to_csv('test.csv', index=False)